tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf6621_tdd.h
#define TRISD3                        522
#define TRISD_RD4                     523
#define TRISD4                        524
#define TRISD_RD5                     525
#define TRISD5                        526
#define TRISD_RD6                     527
#define TRISD6                        528
#define TRISD_RD7                     529
#define TRISD7                        530
#define TRISE                         531
#define TRISE_RE0                     532
#define TRISE0                        533
#define TRISE1                        534
#define TRISE_RE1                     535
#define TRISE2                        536
#define TRISE_RE2                     537
#define TRISE_RE3                     538
#define TRISE3                        539
#define TRISE_RE4                     540
#define TRISE4                        541
#define TRISE_RE5                     542
#define TRISE5                        543
#define TRISE_RE6                     544
#define TRISE6                        545
#define TRISE_RE7                     546
#define TRISE7                        547
#define TRISF                         548
#define TRISF0                        549
#define TRISF_RF0                     550
#define TRISF_RF1                     551
#define TRISF1                        552
#define TRISF_RF2                     553
#define TRISF2                        554
#define TRISF3                        555
#define TRISF_RF3                     556
#define TRISF_RF4                     557
#define TRISF4                        558
#define TRISF_RF5                     559
#define TRISF5                        560
#define TRISF_RF6                     561
#define TRISF6                        562
#define TRISF7                        563
#define TRISF_RF7                     564
#define TRISG                         565
#define TRISG0                        566
#define TRISG_RG0                     567
#define TRISG1                        568
#define TRISG_RG1                     569
#define TRISG2                        570
#define TRISG_RG2                     571
#define TRISG_RG3                     572
#define TRISG3                        573
#define TRISG4                        574
#define TRISG_RG4                     575
#define PIE1                          576
#define TMR1IE                        577
#define TMR2IE                        578
#define CCP1IE                        579
#define SSPIE                         580
#define TXIE                          581
#define TX1IE                         582
#define RCIE                          583
#define RC1IE                         584
#define ADIE                          585
#define PSPIE                         586
#define PIR1                          587
#define TMR1IF                        588
#define TMR2IF                        589
#define CCP1IF                        590
#define SSPIF                         591
#define TXIF                          592
#define TX1IF                         593
#define RCIF                          594
#define RC1IF                         595
#define ADIF                          596
#define PSPIF                         597
#define IPR1                          598
#define TMR1IP                        599
#define TMR2IP                        600
#define CCP1IP                        601
#define SSPIP                         602
#define TX1IP                         603
#define TXIP                          604
#define RC1IP                         605
#define RCIP                          606
#define ADIP                          607
#define PSPIP                         608
#define PIE2                          609
#define CCP2IE                        610
#define TMR3IE                        611
#define LVDIE                         612
#define BCLIE                         613
#define EEIE                          614
#define CMIE                          615
#define PIR2                          616
#define CCP2IF                        617
#define TMR3IF                        618
#define LVDIF                         619
#define BCLIF                         620
#define EEIF                          621
#define CMIF                          622
#define IPR2                          623
#define CCP2IP                        624
#define TMR3IP                        625
#define LVDIP                         626
#define BCLIP                         627
#define EEIP                          628
#define CMIP                          629
#define PIE3                          630
#define CCP3IE                        631
#define RXB0IE                        632
#define RXBNIE                        633
#define RXB1IE                        634
#define CCP4IE                        635
#define TXB0IE                        636
#define CCP5IE                        637
#define TMR4IE                        638
#define TXB1IE                        639
#define TXB2IE                        640
#define TXBNIE                        641
#define TX2IE                         642
#define RC2IE                         643
#define PIR3                          644
#define CCP3IF                        645
#define RXBNIF                        646
#define CCP4IF                        647
#define CCP5IF                        648
#define TMR4IF                        649
#define TXBNIF                        650
#define TX2IF                         651
#define RC2IF                         652
#define IPR3                          653
#define CCP3IP                        654
#define CCP4IP                        655
#define RXBNIP                        656
#define CCP5IP                        657
#define TMR4IP                        658
#define TX2IP                         659
#define TXBNIP                        660
#define RC2IP                         661
#define EECON1                        662
#define EECON1_RD                     663
#define EECON1_WR                     664
#define WREN                          665
#define WRERR                         666
#define FREE                          667
#define CFGS                          668
#define EEFS                          669
#define EEPGD                         670
#define RCSTA1                        671
#define RCSTA1_RX9D                   672
#define RX9D1                         673
#define RCD8                          674
#define RCSTA1_OERR                   675
#define OERR1                         676
#define RCSTA1_FERR                   677
#define FERR1                         678
#define RCSTA1_ADDEN                  679
#define RCSTA1_ADEN                   680
#define ADDEN1                        681
#define RCSTA1_CREN                   682
#define CREN1                         683
#define SRENA                         684
#define SREN1                         685
#define RCSTA1_SREN                   686
#define RC8_9                         687
#define RCSTA1_RX9                    688
#define RC9                           689
#define RX91                          690
#define RCSTA1_SPEN                   691
#define SPEN1                         692
#define TXSTA1                        693
#define TX9D1                         694
#define TXSTA1_TX9D                   695
#define TXD8                          696
#define TRMT1                         697
#define TXSTA1_TRMT                   698
#define BRGH1                         699
#define TXSTA1_BRGH                   700
#define TXSTA1_SENDB                  701
#define SENDB1                        702
#define TXSTA1_SYNC                   703
#define SYNC1                         704
#define TXEN1                         705
#define TXSTA1_TXEN                   706
#define TX91                          707
#define TX8_9                         708
#define TXSTA1_TX9                    709
#define TXSTA1_CSRC                   710
#define CSRC1                         711
#define PSPCON                        712
#define PSPMODE                       713
#define IBOV                          714
#define OBF                           715
#define IBF                           716
#define T3CON                         717
#define TMR3ON                        718
#define TMR3CS                        719
#define nT3SYNC                       720
#define T3NSYNC                       721
#define NOT_T3SYNC                    722
#define T3SYNC                        723
#define SOSCEN3                       724
#define T3CCP1                        725
#define T3CKPS                        726
#define T3CKPS0                       727
#define T3CKPS1                       728
#define T3CCP2                        729
#define T3CON_RD16                    730
#define RD163                         731
#define T3RD16                        732
#define CMCON                         733
#define CM                            734
#define CMEN0                         735
#define CM0                           736
#define CMEN1                         737
#define CM1                           738
#define CMEN2                         739
#define CM2                           740
#define CIS                           741
#define C1INV                         742
#define C2INV                         743
#define C1OUT                         744
#define C2OUT                         745
#define CVRCON                        746
#define CVR                           747
#define CVR0                          748
#define CVR1                          749
#define CVR2                          750
#define CVR3                          751
#define CVRSS                         752
#define CVREF                         753
#define CVRR                          754
#define CVROEN                        755
#define CVROE                         756
#define CVREN                         757
#define ECCP1AS_PSSBD0                758
#define PSS1BD0                       759
#define PSS1BD                        760
#define ECCP1AS_PSSBD1                761
#define PSS1BD1                       762
#define PSS1AC                        763
#define PSS1AC0                       764
#define ECCP1AS_PSSAC0                765
#define PSS1AC1                       766
#define ECCP1AS_PSSAC1                767
#define ECCP1AS                       768
#define ECCP1AS0                      769
#define ECCP1AS1                      770
#define ECCP1AS2                      771
#define ECCP1ASE                      772
#define CCP3CON                       773
#define CCP3M                         774
#define CCP3M0                        775
#define CCP3M1                        776
#define CCP3M2                        777
#define CCP3M3                        778
#define CCP3Y                         779
#define DC3B                          780
#define DC3B0                         781
#define DC3B1                         782
#define CCP3X                         783
#define P3M                           784
#define P3M0                          785
#define P3M1                          786
#define CCP2CON                       787
#define CCP2M                         788
#define CCP2M0                        789
#define CCP2M1                        790
#define CCP2M2                        791
#define CCP2M3                        792
#define DC2B                          793
#define DC2B0                         794
#define CCP2Y                         795
#define DC2B1                         796
#define CCP2X                         797
#define P2M                           798
#define P2M0                          799
#define P2M1                          800
#define CCP1CON                       801
#define CCP1M0                        802
#define CCP1M                         803
#define CCP1M1                        804
#define CCP1M2                        805
#define CCP1M3                        806
#define CCP1Y                         807
#define DC1B                          808
#define DC1B0                         809
#define CCP1X                         810
#define DC1B1                         811
#define P1M                           812
#define P1M0                          813
#define P1M1                          814
#define ADCON2                        815
#define ADCS0                         816
#define ADCS                          817
#define ADCS1                         818
#define ADCS2                         819
#define ACQT0                         820
#define ACQT                          821
#define ACQT1                         822
#define ACQT2                         823
#define ADFM                          824
#define ADCON1                        825
#define PCFG0                         826
#define PCFG                          827
#define PCFG1                         828
#define PCFG2                         829
#define CHSN3                         830
#define PCFG3                         831
#define VCFG                          832
#define VCFG0                         833
#define VCFG01                        834
#define VCFG11                        835
#define VCFG1                         836
#define ADCON0                        837
#define ADON                          838
#define nDONE                         839
#define GO_nDONE                      840
#define NOT_DONE                      841
#define GODONE                        842
#define GO_DONE                       843
#define DONE                          844
#define GO_NOT_DONE                   845
#define GO                            846
#define CHS0                          847
#define CHS                           848
#define CHS1                          849
#define CHS2                          850
#define CHS3                          851
#define SSPCON2                       852
#define SEN                           853
#define RSEN                          854
#define PEN                           855
#define RCEN                          856
#define ACKEN                         857
#define ACKDT                         858
#define ACKSTAT                       859
#define GCEN                          860
#define SSPCON1                       861
#define SSPM0                         862
#define SSPM                          863
#define SSPM1                         864
#define SSPM2                         865
#define SSPM3                         866
#define CKP                           867
#define SSPEN                         868
#define SSPOV                         869
#define WCOL                          870
#define SSPSTAT                       871
#define BF                            872
#define UA                            873
#define R_NOT_W                       874
#define READ_WRITE                    875
#define NOT_W                         876
#define R_W                           877
#define nW                            878
#define RW                            879
#define nWRITE                        880
#define R                             881
#define NOT_WRITE                     882
#define R_nW                          883
#define I2C_READ                      884
#define START                         885
#define S                             886
#define I2C_START                     887
#define STOP                          888
#define I2C_STOP                      889
#define P                             890
#define NOT_A                         891
#define DATA_ADDRESS                  892
#define nA                            893
#define D_A                           894
#define D_nA                          895
#define D                             896
#define DA                            897
#define D_NOT_A                       898
#define NOT_ADDRESS                   899
#define nADDRESS                      900
#define I2C_DAT                       901
#define CKE                           902
#define SMP                           903
#define T2CON                         904
#define T2CKPS0                       905
#define T2CKPS                        906
#define T2CKPS1                       907
#define TMR2ON                        908
#define T2OUTPS0                      909
#define TOUTPS                        910
#define T2OUTPS1                      911
#define T2OUTPS2                      912
#define T2OUTPS3                      913
#define PR2                           914
#define WM0                           915
#define WM1                           916
#define WAIT0                         917
#define WAIT1                         918
#define EBDIS                         919
#define T1CON                         920
#define TMR1ON                        921
#define TMR1CS                        922
#define NOT_T1SYNC                    923
#define T1SYNC                        924
#define nT1SYNC                       925
#define T1INSYNC                      926
#define T1OSCEN                       927
#define SOSCEN                        928
#define T1CKPS0                       929
#define T1CKPS                        930
#define T1CKPS1                       931
#define T1RD16                        932
#define T1CON_RD16                    933
#define RCON                          934
#define BOR                           935
#define NOT_BOR                       936
#define nBOR                          937
#define POR                           938
#define nPOR                          939
#define NOT_POR                       940
#define nPD                           941
#define NOT_PD                        942
#define PD                            943
#define NOT_TO                        944
#define nTO                           945
#define TO                            946
#define nRI                           947
#define NOT_RI                        948
#define RI                            949
#define nIPEN                         950
#define IPEN                          951
#define NOT_IPEN                      952
#define WDTCON                        953
#define SWDTE                         954
#define SWDTEN                        955
#define LVDCON                        956
#define LVV0                          957
#define LVDL0                         958
#define LVDL                          959
#define LVV1                          960
#define LVDL1                         961
#define LVV2                          962
#define LVDL2                         963
#define LVV3                          964
#define LVDL3                         965
#define LVDEN                         966
#define BGST                          967
#define IRVST                         968
#define OSCCON                        969
#define SCS0                          970
#define SCS                           971
#define SCS1                          972
#define PLLEN                         973
#define LOCK                          974
#define T0CON                         975
#define T0PS                          976
#define T0PS0                         977
#define T0PS1                         978
#define T0PS2                         979
#define PSA                           980
#define T0SE                          981
#define T0CS                          982
#define T08BIT                        983
#define TMR0ON                        984
#define STATUS                        985
#define C                             986
#define CARRY                         987
#define DC                            988
#define ZERO                          989
#define Z                             990
#define OV                            991
#define OVERFLOW                      992
#define N                             993
#define NEGATIVE                      994
#define INTCON3                       995
#define INT1IF                        996
#define INT1F                         997
#define INT2IF                        998
#define INT2F                         999
#define INT3F                         1000
#define INT3IF                        1001
#define INT1E                         1002
#define INT1IE                        1003
#define INT2IE                        1004
#define INT2E                         1005
#define INT3E                         1006
#define INT3IE                        1007
#define INT1P                         1008
#define INT1IP                        1009
#define INT2IP                        1010
#define INT2P                         1011
#define INTCON2                       1012
#define RBIP                          1013
#define INT3IP                        1014
#define INT3P                         1015
#define TMR0IP                        1016
#define T0IP                          1017
#define INTEDG3                       1018
#define INTEDG2                       1019
#define INTEDG1                       1020
#define INTEDG0                       1021
#define RBPU                          1022
#define NOT_RBPU                      1023
#define nRBPU                         1024
#define INTCON                        1025
#define RBIF                          1026
#define INT0F                         1027
#define INT0IF                        1028
#define T0IF                          1029
#define TMR0IF                        1030
#define RBIE                          1031
#define INT0E                         1032
#define INT0IE                        1033
#define T0IE                          1034
#define TMR0IE                        1035
#define PEIE                          1036
#define PEIE_GIEL                     1037
#define GIEL                          1038
#define GIE_GIEH                      1039
#define GIE                           1040
#define GIEH                          1041
#define STKPTR0                       1042
#define STKPTR                        1043
#define STKPTR1                       1044
#define STKPTR2                       1045
#define STKPTR3                       1046
#define STKPTR4                       1047
#define STKUNF                        1048
#define STKOVF                        1049
#define STKFUL                        1050

#endif // _PIC18LF6621_H_
